---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SharedParameterReplacedByBuiltInOne
source: html/176fd0d0-08d1-ad3f-5a34-a29bbfda348c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SharedParameterReplacedByBuiltInOne Property

Shared parameter [Name] will be replaced by a built-in parameter with the same name. This may affect scheduling!

## Syntax (C#)
```csharp
public static FailureDefinitionId SharedParameterReplacedByBuiltInOne { get; }
```